In [ ]:
#read_csv   read_table   read_ftf    read_clipboard    read_excel     read_hdf     read_json
#read_msgpack   read_pickle   read_sas    read_sql    read_stata   read_feather

In [2]:
!cat ch06ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [3]:
import pandas as pd
df = pd.read_csv('ch06ex1.csv')

In [4]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
pd.read_table('ch06ex1.csv',sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
!cat ch06ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [8]:
pd.read_csv('ch06ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [9]:
pd.read_csv('ch06ex2.csv',names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
names=['a','b','c','d','message']

In [11]:
pd.read_csv('ch06ex2.csv',names=names,index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [12]:
!cat ch06csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [13]:
parsed = pd.read_csv('ch06csv_mindex.csv',index_col=['key1','key2'])

In [14]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [15]:
list(open('ch06ex3.txt'))

['A                  B                    C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb 0.927272   0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [16]:
result = pd.read_table('ch06ex3.txt',sep='\s+')

In [17]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [18]:
!cat ch06ex4.csv

# hey!,,,,
a,b,c,d,message
# just wanted to make things more difficult for you,,,,
"#who reads CSV files with computerss, anyway?",,,,
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [19]:
pd.read_csv('ch06ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [20]:
!cat ch06ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [21]:
result = pd.read_csv('ch06ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [22]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [23]:
result = pd.read_csv('ch06ex5.csv',na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [24]:
sentinels={'message':['foo','NA'],'something': ['two']}

In [25]:
pd.read_csv('ch06ex5.csv',na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [26]:
pd.options.display.max_rows = 10

In [27]:
result = pd.read_csv('ch06ex6.csv')

In [28]:
pd.read_csv('ch06ex6.csv',nrows=5)

        one       two     three      four key
0  0.467976  0.375855  0.058720  0.054416   L
1  0.800079  0.825793  0.111016  0.139505   B
2  0.923957  0.373217  0.056069  0.368886   G
3  0.790325  0.696681  0.309395  0.862369   R
4  0.717920  0.504400  0.169551  0.357363   Q

In [31]:
chunker = pd.read_csv('ch06ex6.csv',chunksize=50)

In [32]:
chunker

In [33]:
chunker = pd.read_csv('ch06ex6.csv',chunksize=50)

In [34]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(),fill_value=0)
    
tot = tot.sort_values(ascending=False)

In [35]:
tot[:10]

G    20.0
Q    19.0
R    16.0
B    15.0
L    12.0
U     5.0
A     4.0
K     2.0
D     2.0
      2.0
dtype: float64

In [36]:
data=pd.read_csv('ch06ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [37]:
data.to_csv('ch06out.csv')

In [38]:
!cat ch06out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [39]:
import sys

In [40]:
data.to_csv(sys.stdout,sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [41]:
data.to_csv(sys.stdout,na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [43]:
data.to_csv(sys.stdout,index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [44]:
data.to_csv(sys.stdout,index=False,columns=['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [56]:
dates = pd.date_range('1/1/2000',periods=8)

In [58]:
import numpy as np
ts = pd.Series(np.arange(8),index=dates)

In [59]:
ts.to_csv('ch06tseries.csv')

In [60]:
!cat ch06tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6
2000-01-08,7

In [62]:
!cat ch06ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [63]:
import csv
f = open('ch06ex7.csv')
reader = csv.reader(f)

In [64]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [65]:
with open('ch06ex7.csv') as f:
    lines = list(csv.reader(f))

In [66]:
header, values = lines[0], lines[1:]

In [67]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [73]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL    
    
reader = csv.reader(f, dialect=my_dialect)

TypeError: argument 1 must be an iterator

In [74]:
reader = csv.reader(f, delimiter='|')

TypeError: argument 1 must be an iterator

In [ ]:
with open('mydata.csv','w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one','two','three'))
    writer.writerow(('1','2','3'))
    writer.writerow(('4','5','6'))
    writer.writerow(('7','8','9'))

In [ ]:
obj = """ 
{"name":"Wes",
 "places_lived": ["United States","Spain","Germany", "South Korea"],
 "pet": null,
 "siblings": [{"name": "Scott", "age":30,"pets":["Zeus","Zuko"]},
              {"name": "Katie", "age":38, 
               "pets": ["Sixes","Stache","Cisco"]}]
}
"""

In [75]:
import json

In [76]:
result = json.loads(obj)
result

NameError: name 'obj' is not defined

In [77]:
asjson = json.dumps(result)

TypeError: Object of type 'DataFrame' is not JSON serializable

In [ ]:
siblings = pd.DataFrame(result['siblings'], columns=['name','age'])
siblings

In [81]:
import json
!cat ch06example.json

[{"a":1, "b":2, "c":3},
 {"a":4, "b":5, "c":6},
 {"a":7, "b":8, "c":9}]

In [82]:
data = pd.read_json('ch06example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [83]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [84]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [85]:
tables = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [86]:
len(tables)

1

In [87]:
failures = tables[0]

In [88]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
1,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
2,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
3,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
4,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"

In [ ]:
failures.head()

In [89]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [90]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2020      3
2003      3
2007      3
2000      2
Name: Closing Date, Length: 18, dtype: int64

In [ ]:
df = pd.read_html('https://en.wikipedia.org/wiki/All-time_Olympic_Games_medal_table')

In [ ]:
len(df)

In [ ]:
df  #0,1,2,....

In [ ]:
df = pd.read_html('https://en.wikipedia.org/wiki/All-time_Olympic_Games_medal_table',
                 header=0. index_col=0)

In [ ]:
df[1]   #

In [ ]:
summer = df[1].iloc[:,:5]
summer

In [ ]:
summer.columns = ['','','','','']
print(summer)

In [91]:
frame = pd.read_csv('ch06ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [92]:
frame.to_pickle('frame_pickle')

In [93]:
pd.read_pickle('frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [94]:
frame=pd.DataFrame({'a':np.random.randn(100)})

In [95]:
store = pd.HDFStore('mydata.h5')

In [96]:
store['obj1'] = frame

In [97]:
store['obj1_col'] = frame['a']

In [98]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [99]:
store['obj1']

           a
0  -0.523669
1   0.105785
2   0.331630
3   0.430536
4   2.586327
..       ...
95  0.225540
96 -0.796264
97 -0.094208
98  0.028661
99 -0.189943

[100 rows x 1 columns]

In [100]:
store.put('obj2',frame,format='table')

In [101]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10 -1.087339
11 -1.653591
12 -0.472531
13 -0.926723
14 -0.067642
15  1.179371

In [102]:
store.close()

In [103]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [104]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0 -0.523669
1  0.105785
2  0.331630
3  0.430536
4  2.586327

In [123]:
df = pd.read_csv('ch06ex1.csv')
xlsx = df.to_excel('ch06ex1excel.xlsx')

In [126]:
pd.read_excel(xlsx,'Sheet1')

ValueError: Invalid file path or buffer object type: <class 'NoneType'>

In [107]:
frame = pd.read_excel('ch06ex1excel.xlsx','Sheet1')

XLRDError: No sheet named <'Sheet1'>

In [ ]:
frame

In [ ]:
writer=pd.ExcelWriter('ch06ex2excel.xlsx')

In [ ]:
frame.to_excel(writer,'Sheet1')

In [ ]:
writer.save()

In [ ]:
frame.to_excel('ch06ex2excel.xslx')

In [134]:
import requests

In [135]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [136]:
resp = requests.get(url)
resp

In [137]:
data = resp.json()

In [138]:
data[0]['title']

'CI: Split .github\\workflows\\ci.yml into separate workflows'

In [140]:
issues = pd.DataFrame(data, columns=['number','title','labels','state'])
issues

,number,title,labels,state
0,37242,CI: Split .github\workflows\ci.yml into separa...,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
1,37241,"CI move code directives to pre-commit, remove ...",[],open
2,37240,CI move non-standard-import checks over to pre...,[],open
3,37239,DOC: documentation rendering issue for functio...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
4,37238,CLN: clean-up test on addition of series/frames,[],open
...,...,...,...,...
25,37215,CLN: de-duplicate in arithmetic/test_numeric,[],open
26,37213,QST: How to handle Index._id in an Index subcl...,"[{'id': 1218227310, 'node_id': 'MDU6TGFiZWwxMj...",open
27,37211,BUG: Join behaved like an inner join when only...,"[{'id': 71268330, 'node_id': 'MDU6TGFiZWw3MTI2...",open
28,37210,ENH: DataFrame.to_sql with if_exists='replace'...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
29,37209,DOC: add value counts as related method to count,[],open

In [141]:
import sqlite3

In [142]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""

In [143]:
con = sqlite3.connect('mydata.sqlite')

In [144]:
con.execute(query)

In [145]:
con.commit()

In [146]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Talahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]

In [147]:
stmt = "INSERT INTO test VALUES(?,?,?,?)"

In [148]:
con.executemany(stmt, data)

In [149]:
con.commit()

In [150]:
cursor = con.execute('select * from test')

In [151]:
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Talahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [152]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [153]:
pd.DataFrame(rows, columns = [x[0] for x in cursor.description])

            a           b     c  d
0     Atlanta     Georgia  1.25  6
1  Talahassee     Florida  2.60  3
2  Sacramento  California  1.70  5

In [154]:
import sqlalchemy as sqla

In [155]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [156]:
pd.read_sql('select * from test',db)

            a           b     c  d
0     Atlanta     Georgia  1.25  6
1  Talahassee     Florida  2.60  3
2  Sacramento  California  1.70  5